Fetching single material SOAP

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:glob="http://sap.com/xi/SAPGlobal20/Global"
    xmlns:gdt="http://sap.com/xi/AP/Common/GDT">

  <soapenv:Header/>

  <soapenv:Body>
    <glob:MaterialByElementsQuery_sync>
      <MaterialSelectionByElements>

        <!-- Filter by exact Internal ID (single material) -->
        <SelectionByInternalID>
          <InclusionExclusionCode>I</InclusionExclusionCode>
          <IntervalBoundaryTypeCode>3</IntervalBoundaryTypeCode>
          <LowerBoundaryInternalID>{{MATERIAL_ID}}</LowerBoundaryInternalID>
          <UpperBoundaryInternalID>{{MATERIAL_ID}}</UpperBoundaryInternalID>
        </SelectionByInternalID>

      </MaterialSelectionByElements>

      <ProcessingConditions>
        <QueryHitsMaximumNumberValue>{{MAX_RESULTS}}</QueryHitsMaximumNumberValue>
        <QueryHitsUnlimitedIndicator>{{UNLIMITED_RESULTS}}</QueryHitsUnlimitedIndicator>
        <LastReturnedObjectID>{{LAST_OBJECT_ID}}</LastReturnedObjectID>
      </ProcessingConditions>
    </glob:MaterialByElementsQuery_sync>
  </soapenv:Body>
</soapenv:Envelope>
